package OOP;

//  Інтерфейси - структура коду, які можуть мати константи, абстрактні і дефолтні методи. Будь яке поле, яке пишеться
//  в інтерфейсі, одразу ж є константоюю. Якщо ми можемо наслідувати лише один клас, імплементувати інтерфейсів ми
//  можемо скільки хочемо. Дефолтний метод, ми можемо не імплементувати, тому що він не є абстрактним, він має тіло.
public interface ChangeSomeThing {

    int a = 10;
    void draw();
    default void close() {
        System.out.println("interface default method ");
    }

}
