package data_types_variables;

public class Main {
    public static void main(String[] args) {

//        Клас String допомагає створити стрінгу
        String name = "John";

//        int 4 bytes. Зберігає цілі числа від -2,147,483,648 до 2,147,483,647
        int age;
        age = 35;
        System.out.println(age);

//        float 4 bytes. Зберігає дробові числа. Досить для зберігання від 6 до 7 десяткових цифр
        float weight;
        weight = 5.75f;
        weight = 55;
        System.out.println(weight); // will be 55

//        char 2 bytes. Stores a single character/letter or ASCII values
        char character = 'B';

//        boolean 1 bit. Зберігає істинні або хибні значення
        boolean status;
        status = false;
        boolean salary = true;


//        long 8 bytes. Зберігає цілі числа від -9,223,372,036,854,775,808 до 9,223,372,036,854,775,807
        long phones;

//        short 2 bytes. Зберігає цілі числа від -32 768 до 32 767
        short watches;

//        double 8 bytes. Stores fractional numbers. Sufficient for storing 15 decimal digits
        double height = 180.55;

//        Типи даних поділяються на дві групи:
//        Примітивні типи даних - включає byte, short, int, long, float, double, boolean і char
//        Непримітивні типи даних, такі як String, Arrays and Classes

//        Непримітивні типи даних називаються опорними типами, оскільки вони посилаються на об’єкти
//        Основна відмінність між примітивними і непримітивними типами даних:
//
//        - Примітивні типи попередньо визначені (уже визначені)в Java.Непримітивні типи створюються програмістом і не
//        визначаються Java (за винятком String).

//        - Непримітивні типи можна використовувати для виклику методів для виконання певних операцій, тоді як примітивні
//        типи —ні.
//
//        - Примітивний тип завжди має значення, тоді як непримітивні типи можуть бути null.

//        - Примітивний тип починається з малої літери, тоді як непримітивний тип починається з великої літери.

//        - Розмір примітивного типу залежить від типу даних, тоді як непримітивні типи мають однаковий розмір.

//        Прикладами непримітивних типів є рядки, масиви, класи, інтерфейс тощо.Ви дізнаєтеся більше про них у
//        наступному розділі.

    }
}